incompressibleVoF/DTCHullWave/system/functions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      functions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

rigidBodyForces
{
    type            rigidBodyForces;
    libs            ("librigidBodyForces.so");
    body            hull;
    patches         (hull);
    log             on;
    writeControl    timeStep;
    writeInterval   1;
}

surfaces
{
    type            surfaces;
    libs            ("libsampling.so");

    writeControl    adjustableRunTime;
    writeInterval   0.01;

    surfaceFormat   vtk;
    writeFormat     binary;
    fields          (p_rgh U);

    interpolationScheme cellPoint;

    surfaces
    (
        interface
        {
            type            isoSurface;
            isoField        alpha.water;
            isoValue        0.5;
            interpolate     true;
        }
    );
}

// ************************************************************************* //
